routes/api.php


// Login (obtenir token)
Route::post('/login', function (Request $request) {
    $user = User::where('email', $request->email)->first();
---
select * from "users" where "email" = 'admin@test.com' limit 1