app/Http/Controllers/UserController.php

    public function index()
    {
        return User::all();
---
select * from "users"