app/Models/Compte.php

    public function getSoldeAttribute(): float
    {
        $depot = $this->transactions()->where('type', 'depot')->sum('montant');
        $retrait = $this->transactions()->where('type', 'retrait')->sum('montant');
---
select sum("montant") as aggregate from "transactions" where "transactions"."compte_id" = 'a032f397-7e6f-4772-9a1c-526516c09ee4' and "transactions"."compte_id" is not null and "type" = 'depot'
select sum("montant") as aggregate from "transactions" where "transactions"."compte_id" = 'a032f397-7e6f-4772-9a1c-526516c09ee4' and "transactions"."compte_id" is not null and "type" = 'retrait'